Repository: moumouh206/clear_flutter_app_suger_free
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Clear
ar: كلير
fr: Clair

source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord

source: Timeline
ar: الرحلة
fr: Parcours

source: History
ar: السجل
fr: Historique

source: Settings
ar: الإعدادات
fr: Paramètres

source: Days Sugar-Free
ar: أيام بدون سكر
fr: Jours sans sucre

source: Did you stay sugar-free today?
ar: هل بقيت بدون سكر اليوم؟
fr: Êtes-vous resté sans sucre aujourd'hui ?

source: YES, I WAS SUCCESSFUL
ar: نعم، لقد نجحت
fr: OUI, J'AI RÉUSSI

# successRecorded
source: SUCCESS RECORDED âœ“
ar: تم تسجيل النجاح ✓
fr: SUCCÈS ENREGISTRÉ ✓

source: I had a slip-up
ar: لقد تعثرت
fr: J'ai fait un écart

source: Your History
ar: سجلك
fr: Votre historique

# tapDayToToggle
source: Tap any day to mark it as sugar-free or to remove it.
ar: انقر على أي يوم لتحديده كيوم خالٍ من السكر أو لإزالته.
fr: Appuyez sur un jour pour le marquer comme 'sans sucre' ou le supprimer.

source: Your Journey
ar: رحلتك
fr: Votre parcours

source: Locked
ar: مُقفل
fr: Verrouillé

source: APPEARANCE
ar: المظهر
fr: APPARENCE

source: Dark Mode
ar: الوضع الداكن
fr: Mode sombre

source: Language
ar: اللغة
fr: Langue

source: CHALLENGE
ar: التحدي
fr: DÉFI

source: Hard Mode
ar: الوضع الصعب
fr: Mode difficile

# hardModeSubtitle
source: Hides your streak counter.
ar: يخفي عداد الأيام المتتالية.
fr: Masque votre compteur de série.

source: DATA
ar: البيانات
fr: DONNÉES

source: Reset All Data
ar: إعادة تعيين كل البيانات
fr: Réinitialiser toutes les données

# resetAllDataSubtitle
source: This will permanently delete your streak and settings.
ar: سيؤدي هذا إلى حذف سلسلة أيامك وإعداداتك بشكل دائم.
fr: Ceci supprimera définitivement votre série et vos paramètres.

source: Are you sure?
ar: هل أنت متأكد؟
fr: Êtes-vous sûr ?

# actionCannotBeUndone
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action est irréversible.

source: Cancel
ar: إلغاء
fr: Annuler

source: RESET
ar: إعادة تعيين
fr: RÉINITIALISER

# slipUpDialogTitle
source: It's okay, it happens.
ar: لا بأس، هذا يحدث.
fr: Ce n'est pas grave, ça arrive.

# slipUpDialogSubtitle
source: One slip-up doesn't erase your progress. Every sugar-free day counts.
ar: زلّة واحدة لا تمحو تقدمك. كل يوم خالٍ من السكر له قيمته.
fr: Un seul écart n'efface pas vos progrès. Chaque jour sans sucre compte.

# slipUpTriggerQuestion
source: What was the trigger? (Optional)
ar: ما هو المحفز؟ (اختياري)
fr: Quel a été le déclencheur ? (Optionnel)

# slipUpTriggerHint
source: e.g., stress at work, a party...
ar: مثال: ضغط العمل، حفلة...
fr: ex: stress au travail, une fête...

source: RESET MY STREAK
ar: إعادة تعيين سلسلتي
fr: RÉINITIALISER MA SÉRIE

# todaysSuccessRemoved
source: Today's success has been removed.
ar: تمت إزالة نجاح اليوم.
fr: Le succès d'aujourd'hui a été supprimé.

source: App has been reset.
ar: تمت إعادة تعيين التطبيق.
fr: L'application a été réinitialisée.

# milestone1Title
source: Day 1: The First Step
ar: اليوم الأول: الخطوة الأولى
fr: Jour 1 : Le premier pas

# milestone1Body
source: Your insulin levels are starting to stabilize. Your liver is getting a much-needed break from processing fructose, beginning the transition to fat-burning.
ar: بدأت مستويات الأنسولين لديك بالاستقرار. يحصل كبدك على استراحة هو في أمس الحاجة إليها من معالجة الفركتوز، ليبدأ الانتقال إلى حرق الدهون.
fr: Vos niveaux d'insuline commencent à se stabiliser. Votre foie bénéficie d'une pause bien méritée dans le traitement du fructose, amorçant la transition vers la combustion des graisses.

# milestone1Mind
source: The first psychological hurdle. You've made a conscious decision and stuck with it. Well done.
ar: العقبة النفسية الأولى. لقد اتخذت قرارًا واعيًا والتزمت به. أحسنت صنعًا.
fr: Le premier obstacle psychologique. Vous avez pris une décision consciente et vous y êtes tenu. Bravo.

# milestone2Title
source: Day 2: The Cleanse
ar: اليوم الثاني: التطهير
fr: Jour 2 : La détox

# milestone2Body
source: You might feel a bit foggy or have a headache. This is a positive sign! It's your body recalibrating its hormonal and metabolic systems. It's a true detox.
ar: قد تشعر ببعض الضبابية أو الصداع. هذه علامة إيجابية! إن جسمك يعيد معايرة أنظمته الهرمونية والأيضية. إنه تطهير حقيقي.
fr: Vous pourriez vous sentir un peu dans le brouillard ou avoir mal à la tête. C'est un signe positif ! Votre corps recalibre ses systèmes hormonaux et métaboliques. C'est une vraie détox.

# milestone2Mind
source: This is often the toughest day for cravings as your brain's reward system screams for a fix. Acknowledge the feeling and let it pass. It's temporary.
ar: غالبًا ما يكون هذا أصعب يوم للرغبة الشديدة حيث يصرخ نظام المكافأة في دماغك طلبًا للجرعة. اعترف بالشعور ودعه يمر. إنه مؤقت.
fr: C'est souvent le jour le plus difficile pour les envies, car le système de récompense de votre cerveau réclame sa dose. Reconnaissez ce sentiment et laissez-le passer. C'est temporaire.

# milestone3Title
source: Day 3: Peak Challenge
ar: اليوم الثالث: ذروة التحدي
fr: Jour 3 : Le pic du défi

# milestone3Body
source: Your dopamine pathways are starting to reset. Your body is becoming more 'insulin-sensitive,' which is fantastic for your long-term health.
ar: بدأت مسارات الدوبامين في إعادة الضبط. أصبح جسمك أكثر 'حساسية للأنسولين'، وهو أمر رائع لصحتك على المدى الطويل.
fr: Vos voies dopaminergiques commencent à se réinitialiser. Votre corps devient plus 'sensible à l'insuline', ce qui est fantastique pour votre santé à long terme.

# milestone3Mind
source: You've made it through the hardest part of the initial withdrawal. From here, the physical cravings will start to subside.
ar: لقد تجاوزت أصعب جزء من الانسحاب الأولي. من الآن فصاعدًا، ستبدأ الرغبة الجسدية الشديدة في التلاشي.
fr: Vous avez franchi la partie la plus difficile du sevrage initial. À partir de maintenant, les envies physiques commenceront à diminuer.

# milestone5Title
source: Day 5: Gut Guardian
ar: اليوم الخامس: حارس الأمعاء
fr: Jour 5 : Gardien de l'intestin

# milestone5Body
source: The 'bad' bacteria in your gut that thrive on sugar are starting to die off. This makes room for beneficial bacteria to flourish, improving digestion and overall gut health.
ar: بدأت البكتيريا 'الضارة' في أمعائك التي تتغذى على السكر في الموت. هذا يفسح المجال للبكتيريا المفيدة للازدهار، مما يحسن الهضم وصحة الأمعاء بشكل عام.
fr: Les 'mauvaises' bactéries de votre intestin qui se nourrissent de sucre commencent à disparaître. Cela laisse place aux bactéries bénéfiques pour se développer, améliorant la digestion et la santé intestinale globale.

# milestone5Mind
source: You're noticing a pattern and proving to yourself that you don't need sugar to get through the day.
ar: أنت تلاحظ نمطًا وتثبت لنفسك أنك لست بحاجة إلى السكر لقضاء يومك.
fr: Vous remarquez une tendance et vous vous prouvez que vous n'avez pas besoin de sucre pour passer la journée.

# milestone7Title
source: Day 7: The Taste Bud Reset
ar: اليوم السابع: إعادة ضبط براعم التذوق
fr: Jour 7 : Le reset des papilles

# milestone7Body
source: Your taste buds are no longer desensitized by overwhelming sweetness. An apple or a strawberry will start to taste incredibly sweet and flavorful.
ar: لم تعد براعم التذوق لديك غير حساسة بسبب الحلاوة المفرطة. ستبدأ التفاحة أو الفراولة في أن تكون ذات مذاق حلو ولذيذ بشكل لا يصدق.
fr: Vos papilles ne sont plus désensibilisées par une douceur écrasante. Une pomme ou une fraise commencera à avoir un goût incroyablement sucré et savoureux.

# milestone7Mind
source: A major milestone! You've completed a full week. The habit is beginning to form.
ar: إنجاز كبير! لقد أكملت أسبوعًا كاملاً. بدأت العادة في التكون.
fr: Une étape majeure ! Vous avez terminé une semaine complète. L'habitude commence à se former.

# milestone14Title
source: Day 14: The Glow Up
ar: اليوم الرابع عشر: الإشراقة
fr: Jour 14 : L'éclat retrouvé

# milestone14Body
source: Sugar damages collagen. By cutting it out, you're stopping this damage. Reduced inflammation can lead to clearer, calmer skin.
ar: السكر يدمر الكولاجين. بقطعه، أنت توقف هذا الضرر. يمكن أن يؤدي تقليل الالتهاب إلى بشرة أكثر صفاءً وهدوءًا.
fr: Le sucre endommage le collagène. En l'arrêtant, vous stoppez ces dégâts. La réduction de l'inflammation peut conduire à une peau plus nette et plus calme.

# milestone14Mind
source: Two weeks! Your commitment is solidifying. This is no longer a fluke; it's a lifestyle change.
ar: أسبوعان! التزامك يترسخ. لم يعد هذا صدفة؛ إنه تغيير في نمط الحياة.
fr: Deux semaines ! Votre engagement se solidifie. Ce n'est plus un hasard ; c'est un changement de style de vie.

# milestone21Title
source: Day 21: The Habit Loop
ar: اليوم 21: حلقة العادة
fr: Jour 21 : La boucle de l'habitude

# milestone21Body
source: Your brain has had enough time to start forming new neural pathways. Reaching for a healthy snack instead of a sugary one feels more natural.
ar: لقد كان لدى دماغك ما يكفي من الوقت لبدء تكوين مسارات عصبية جديدة. أصبح تناول وجبة خفيفة صحية بدلاً من وجبة سكرية أكثر طبيعية.
fr: Votre cerveau a eu suffisamment de temps pour commencer à former de nouvelles voies neuronales. Opter pour une collation saine au lieu d'une collation sucrée semble plus naturel.

# milestone21Mind
source: They say it takes 21 days to form a habit. You've just laid the foundation for a permanent, positive change.
ar: يقولون إن الأمر يستغرق 21 يومًا لتكوين عادة. لقد وضعت للتو الأساس لتغيير إيجابي ودائم.
fr: On dit qu'il faut 21 jours pour former une habitude. Vous venez de poser les bases d'un changement positif et permanent.

# milestone30Title
source: Day 30: The Energy Upgrade
ar: اليوم 30: ترقية الطاقة
fr: Jour 30 : Le gain d'énergie

# milestone30Body
source: Your body is now efficient at using fat for fuel, leading to more stable energy without the afternoon crashes. Your triglyceride levels have likely dropped significantly.
ar: أصبح جسمك الآن فعالاً في استخدام الدهون كوقود، مما يؤدي إلى طاقة أكثر استقرارًا بدون انهيارات فترة ما بعد الظهر. من المحتمل أن تكون مستويات الدهون الثلاثية لديك قد انخفضت بشكل كبير.
fr: Votre corps est maintenant efficace pour utiliser les graisses comme carburant, ce qui conduit à une énergie plus stable sans les coups de barre de l'après-midi. Vos niveaux de triglycérides ont probablement chuté de manière significative.

# milestone30Mind
source: You've conquered a whole month. Your self-efficacy is sky-high. You are in control.
ar: لقد غزوت شهرًا كاملاً. كفاءتك الذاتية في عنان السماء. أنت المتحكم.
fr: Vous avez conquis un mois entier. Votre sentiment d'auto-efficacité est au plus haut. Vous êtes en contrôle.

# milestone40Title
source: Day 40: The Dental Dividend
ar: اليوم 40: عائد الأسنان
fr: Jour 40 : Le bénéfice dentaire

# milestone40Body
source: The harmful bacteria in your mouth that cause cavities thrive on sugar. By starving them, you're dramatically improving your oral health and reducing inflammation in your gums.
ar: البكتيريا الضارة في فمك التي تسبب التسوس تتغذى على السكر. بتجويعها، أنت تحسن صحة فمك بشكل كبير وتقلل من التهاب اللثة.
fr: Les bactéries nocives dans votre bouche qui causent les caries se nourrissent de sucre. En les affamant, vous améliorez considérablement votre santé bucco-dentaire et réduisez l'inflammation de vos gencives.

# milestone40Mind
source: Your mouth feels cleaner, and you're investing in a future with fewer dental bills. That's a reason to smile.
ar: تشعر أن فمك أنظف، وأنت تستثمر في مستقبل بفواتير أسنان أقل. هذا سبب للابتسام.
fr: Votre bouche est plus propre, et vous investissez dans un avenir avec moins de factures de dentiste. C'est une raison de sourire.

# milestone60Title
source: Day 60: Deeper Sleep
ar: اليوم 60: نوم أعمق
fr: Jour 60 : Un sommeil plus profond

# milestone60Body
source: Without blood sugar spikes and crashes disrupting your night, your body can achieve deeper, more restorative sleep cycles. This improves everything from memory to mood.
ar: بدون ارتفاع وانخفاض نسبة السكر في الدم التي تعطل ليلتك، يمكن لجسمك تحقيق دورات نوم أعمق وأكثر استعادة. هذا يحسن كل شيء من الذاكرة إلى المزاج.
fr: Sans les pics et les chutes de sucre dans le sang qui perturbent votre nuit, votre corps peut atteindre des cycles de sommeil plus profonds et plus réparateurs. Cela améliore tout, de la mémoire à l'humeur.

# milestone60Mind
source: Waking up feeling genuinely rested becomes the new normal, not the exception.
ar: الاستيقاظ وأنت تشعر بالراحة الحقيقية يصبح هو القاعدة الجديدة، وليس الاستثناء.
fr: Se réveiller en se sentant vraiment reposé devient la nouvelle norme, pas l'exception.

# milestone75Title
source: Day 75: Autophagy Activated
ar: اليوم 75: تفعيل الالتهام الذاتي
fr: Jour 75 : Autophagie activée

# milestone75Body
source: With lower insulin levels, your body's cellular cleanup process, known as 'autophagy,' can work more effectively. It's like a deep spring-cleaning for your cells, removing damaged parts.
ar: مع انخفاض مستويات الأنسولين، يمكن لعملية التنظيف الخلوي في جسمك، المعروفة باسم 'الالتهام الذاتي'، أن تعمل بفعالية أكبر. إنها مثل تنظيف ربيعي عميق لخلاياك.
fr: Avec des niveaux d'insuline plus bas, le processus de nettoyage cellulaire de votre corps, connu sous le nom d'autophagie, peut fonctionner plus efficacement. C'est comme un grand nettoyage de printemps pour vos cellules.

# milestone75Mind
source: You're not just looking better, you are fundamentally healthier on a cellular level. This is deep healing.
ar: أنت لا تبدو أفضل فحسب، بل أنت أكثر صحة بشكل أساسي على المستوى الخلوي. هذا شفاء عميق.
fr: Vous n'avez pas seulement meilleure mine, vous êtes fondamentalement en meilleure santé au niveau cellulaire. C'est une guérison profonde.

# milestone90Title
source: Day 90: Mental Sharpness
ar: اليوم 90: حدة ذهنية
fr: Jour 90 : Clarté mentale

# milestone90Body
source: Reduced inflammation in the brain and stable energy supply leads to less 'brain fog,' better focus, and improved memory recall.
ar: يؤدي تقليل الالتهاب في الدماغ وإمدادات الطاقة المستقرة إلى تقليل 'ضباب الدماغ'، وتركيز أفضل، وتحسين استدعاء الذاكرة.
fr: La réduction de l'inflammation dans le cerveau et un apport énergétique stable conduisent à moins de 'brouillard cérébral', une meilleure concentration et un meilleur rappel de la mémoire.

# milestone90Mind
source: You feel sharper and more clear-headed. Complex tasks seem less daunting.
ar: تشعر بأنك أكثر حدة ووضوحًا في التفكير. تبدو المهام المعقدة أقل صعوبة.
fr: Vous vous sentez plus vif et plus lucide. Les tâches complexes semblent moins intimidantes.

# milestone120Title
source: 4 Months: The Immune Boost
ar: 4 أشهر: تعزيز المناعة
fr: 4 Mois : Le boost immunitaire

# milestone120Body
source: High sugar intake can impair the function of your white blood cells. After four months, your immune system is operating without this handicap, better equipped to fight off infections.
ar: يمكن أن يضعف تناول كميات كبيرة من السكر وظيفة خلايا الدم البيضاء. بعد أربعة أشهر، يعمل جهازك المناعي بدون هذا العائق، وهو مجهز بشكل أفضل لمحاربة العدوى.
fr: Une consommation élevée de sucre peut altérer la fonction de vos globules blancs. Après quatre mois, votre système immunitaire fonctionne sans ce handicap, mieux équipé pour combattre les infections.

# milestone120Mind
source: You're building a more resilient body, one that's better prepared to defend itself.
ar: أنت تبني جسمًا أكثر مرونة، وأكثر استعدادًا للدفاع عن نفسه.
fr: Vous construisez un corps plus résilient, mieux préparé à se défendre.

# milestone150Title
source: 5 Months: The Stress Shield
ar: 5 أشهر: درع الإجهاد
fr: 5 Mois : Le bouclier anti-stress

# milestone150Body
source: The cortisol rollercoaster caused by blood sugar swings is a thing of the past. Your body's stress-response system is calmer and more regulated, improving your mood and resilience.
ar: أصبحت تقلبات الكورتيزول الناتجة عن تأرجح نسبة السكر في الدم شيئًا من الماضي. أصبح نظام استجابة الجسم للضغط أكثر هدوءًا وتنظيمًا، مما يحسن مزاجك ومرونتك.
fr: Les montagnes russes de cortisol causées par les variations de la glycémie appartiennent au passé. Le système de réponse au stress de votre corps est plus calme et mieux régulé, améliorant votre humeur et votre résilience.

# milestone150Mind
source: You may find you're less reactive to daily stressors. You have more emotional bandwidth.
ar: قد تجد أنك أقل تفاعلًا مع الضغوطات اليومية. لديك نطاق عاطفي أكبر.
fr: Vous constaterez peut-être que vous êtes moins réactif aux stresseurs quotidiens. Vous avez plus de latitude émotionnelle.

# milestone180Title
source: 6 Months: Healthy Heart
ar: 6 أشهر: قلب صحي
fr: 6 Mois : Un cœur en bonne santé

# milestone180Body
source: Significant improvements in cardiovascular risk factors, including blood pressure, cholesterol levels (lower LDL, higher HDL), and triglycerides.
ar: تحسينات كبيرة في عوامل خطر الإصابة بأمراض القلب والأوعية الدموية، بما في ذلك ضغط الدم ومستويات الكوليسترول (انخفاض LDL وارتفاع HDL) والدهون الثلاثية.
fr: Améliorations significatives des facteurs de risque cardiovasculaire, y compris la pression artérielle, les niveaux de cholestérol (LDL plus bas, HDL plus élevé) et les triglycérides.

# milestone180Mind
source: You've actively and dramatically reduced your risk for future health problems. This is a huge win.
ar: لقد قللت بشكل فعال وبشكل كبير من خطر إصابتك بمشاكل صحية في المستقبل. هذا فوز كبير.
fr: Vous avez activement et considérablement réduit votre risque de problèmes de santé futurs. C'est une immense victoire.

# milestone240Title
source: 8 Months: Slowing the Clock
ar: 8 أشهر: إبطاء الساعة
fr: 8 Mois : Ralentir l'horloge

# milestone240Body
source: You've drastically reduced the formation of 'AGEs' (Advanced Glycation End-products) in your body. These compounds stiffen tissues and accelerate aging, so you're protecting your skin, organs, and joints.
ar: لقد قللت بشكل كبير من تكوين 'المنتجات النهائية للجليكشن المتقدمة' (AGEs) في جسمك. هذه المركبات تزيد من تصلب الأنسجة وتسرع الشيخوخة، وبالتالي تحمي بشرتك وأعضائك ومفاصلك.
fr: Vous avez considérablement réduit la formation des 'produits de glycation avancée' (AGE) dans votre corps. Ces composés rigidifient les tissus et accélèrent le vieillissement, protégeant ainsi votre peau, vos organes et vos articulations.

# milestone240Mind
source: This is a long-term investment in your future self. You're not just healthier now; you're setting the stage for more graceful aging.
ar: هذا استثمار طويل الأجل في مستقبلك. أنت لست أكثر صحة الآن فحسب؛ بل تمهد الطريق لشيخوخة أكثر رشاقة.
fr: C'est un investissement à long terme pour votre futur vous. Vous n'êtes pas seulement en meilleure santé maintenant ; vous préparez le terrain pour un vieillissement plus gracieux.

# milestone300Title
source: Day 300: The Milestone Master
ar: اليوم 300: سيد الإنجازات
fr: Jour 300 : Le maître des étapes

# milestone300Body
source: This achievement isn't about a new biological process; it's about acknowledging your incredible consistency. 300 days is a monumental display of discipline and commitment.
ar: هذا الإنجاز لا يتعلق بعملية بيولوجية جديدة؛ إنه يتعلق بالاعتراف بثباتك المذهل. 300 يوم هو عرض هائل للانضباط والالتزام.
fr: Cet accomplissement ne concerne pas un nouveau processus biologique ; il s'agit de reconnaître votre incroyable constance. 300 jours est une démonstration monumentale de discipline et d'engagement.

# milestone300Mind
source: This is no longer a challenge; it's a core part of who you are. You are someone who prioritizes their health, and you've proven it 300 times over.
ar: لم يعد هذا تحديًا؛ إنه جزء أساسي من هويتك. أنت شخص يعطي الأولوية لصحته، وقد أثبتت ذلك 300 مرة.
fr: Ce n'est plus un défi ; c'est une partie essentielle de qui vous êtes. Vous êtes quelqu'un qui priorise sa santé, et vous l'avez prouvé 300 fois.

# milestone365Title
source: 1 Year: A New Baseline
ar: سنة واحدة: معيار جديد
fr: 1 An : Une nouvelle référence

# milestone365Body
source: You've rewired your metabolism and significantly lowered your risk for Type 2 diabetes and other chronic illnesses. Your body has established a new, healthier normal.
ar: لقد أعدت برمجة عملية الأيض لديك وخفضت بشكل كبير من خطر الإصابة بمرض السكري من النوع 2 والأمراض المزمنة الأخرى. لقد أسس جسمك حالة طبيعية جديدة وصحية.
fr: Vous avez reprogrammé votre métabolisme et réduit de manière significative votre risque de diabète de type 2 et d'autres maladies chroniques. Votre corps a établi une nouvelle normalité, plus saine.

# milestone365Mind
source: This is no longer something you 'do'; it's your identity. Celebrate this incredible achievement and the person you've become.
ar: لم يعد هذا شيئًا 'تفعله'؛ إنها هويتك. احتفل بهذا الإنجاز المذهل والشخص الذي أصبحت عليه.
fr: Ce n'est plus quelque chose que vous 'faites' ; c'est votre identité. Célébrez cet accomplissement incroyable et la personne que vous êtes devenue.
